/******************************************************************************
 *	 DTV LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
 *	 Copyright(c) 1999 by LG Electronics Inc.
 *
 *	 All rights reserved. No part of this work may be reproduced, stored in a
 *	 retrieval system, or transmitted by any means without prior written
 *	 permission of LG Electronics Inc.
 *****************************************************************************/

/** @file osa_exception.h
 *
 *	SC API - exception functions.
 *
 *	@author 	junorion
 *	@version	1.0
 *	@date		2007. 6. 1
 *	@note
 *	@see
 */

/******************************************************************************
	Header File Guarder
******************************************************************************/

#ifndef __OSA_EXCEPTION_H__
#define __OSA_EXCEPTION_H__

#ifdef __cplusplus
extern "C" {
#endif
/******************************************************************************
	#include 파일들 (File Inclusions)
******************************************************************************/
#include "adap.h"
/******************************************************************************
	상수 정의(Constant Definitions)
******************************************************************************/

/******************************************************************************
	매크로 함수 정의 (Macro Definitions)
******************************************************************************/

/******************************************************************************
	형 정의 (Type Definitions)
******************************************************************************/

/******************************************************************************
	함수 선언 (Function Declaration)
******************************************************************************/

#ifdef __cplusplus
}
#endif
#endif /*__OSA_EXCEPTION_H__*/
