/*
* 2017.09.07 - change this file
* (C) Huawei Technologies Co., Ltd. < >
*/
/******************************************************************************

                  版权所有 (C), 2008-2018, 海思半导体有限公司

 ******************************************************************************
  文 件 名   : clkdev.h
  版 本 号   : 初稿
  生成日期   : D2014_03_12

******************************************************************************/
#ifndef __CLKDEV_H__
#define __CLKDEV_H__

#define __clk_get(clk) ({ 1; })
#define __clk_put(clk) do { } while (0)

#endif /* __CLKDEV_H__ */
