/*
* 2017.09.07 - change this file
* (C) Huawei Technologies Co., Ltd. < >
*/
/******************************************************************************

                  版权所有 (C), 2008-2018, 海思半导体有限公司

 ******************************************************************************
  文 件 名   : memory.h
  版 本 号   : 初稿
  生成日期   : D2014_03_11

******************************************************************************/
#ifndef __MEMORY_H__
#define __MEMORY_H__

/*
 * Physical DRAM offset.
 */
#define PLAT_PHYS_OFFSET	UL(CONFIG_HSAN_PHYS_OFFSET)


#endif /* __MEMORY_H__ */
