/*
* 2017.09.07 - change this file
* (C) Huawei Technologies Co., Ltd. < >
*/
/******************************************************************************

                  版权所有 (C), 2008-2018, 海思半导体有限公司

 ******************************************************************************
  文 件 名   : system.h
  版 本 号   : 初稿
  生成日期   : D2014_03_12

******************************************************************************/
#ifndef __SYSTEM_H__
#define __SYSTEM_H__

void arch_idle(void);
void arch_reset(char mode,const char *cmd);

#endif /* __SYSTEM_H__ */
