/*
* 2017.09.07 - change this file
* (C) Huawei Technologies Co., Ltd. < >
*/
/******************************************************************************

                  版权所有 (C), 2008-2018, 海思半导体有限公司

 ******************************************************************************
  文 件 名   : timex.h
  版 本 号   : 初稿
  生成日期   : D2014_03_11

******************************************************************************/
#ifndef __TIMEX_H__
#define __TIMEX_H__

#define CLOCK_TICK_RATE	CONFIG_HSAN_BUSCLK //100000000	

#endif /* __TIMEX_H__ */
